In [3]:
import pandas as pd

In [4]:
s1 = pd.Series(["Bat","Ball","Batminton"])
s1

0          Bat
1         Ball
2    Batminton
dtype: object

In [5]:
s2 = pd.Series(["Blue","Red","White"])
s2

0     Blue
1      Red
2    White
dtype: object

In [6]:
s3 = pd.Series([200,50,100])
s3

0    200
1     50
2    100
dtype: int64

In [7]:
d1 = pd.DataFrame({"Items":s1,"Colour":s2,"Price":s3})
d1

       Items Colour  Price
0        Bat   Blue    200
1       Ball    Red     50
2  Batminton  White    100

In [8]:
student = pd.read_csv("abc.csv")
student

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [9]:
mean = student.mean(numeric_only=True)
mean

language    54.285714
science     53.000000
maths       43.285714
history     42.857143
dtype: float64

In [10]:
median = student.median(numeric_only=True)
median

language    50.0
science     56.0
maths       45.0
history     34.0
dtype: float64

In [11]:
std = student.std(numeric_only=True)
std

language    35.523299
science     22.015146
maths       23.746679
history     17.062909
dtype: float64

In [12]:
student.dtypes

student     object
language     int64
science      int64
maths        int64
history      int64
dtype: object

In [13]:
student.columns

Index(['student', 'language', 'science', 'maths', 'history'], dtype='object')

In [14]:
student.index

RangeIndex(start=0, stop=7, step=1)

In [15]:
student.describe

<bound method NDFrame.describe of   student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23>

In [16]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   student   7 non-null      object
 1   language  7 non-null      int64
 2   science   7 non-null      int64
 3   maths     7 non-null      int64
 4   history   7 non-null      int64
dtypes: int64(4), object(1)
memory usage: 412.0+ bytes

In [17]:
student.mode(numeric_only=True)

   language  science  maths  history
0        90       56     45       34

In [18]:
student.head()

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65

In [19]:
student.tail()

  student  language  science  maths  history
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [20]:
s1 = student.maths

In [28]:
for i in range(1,4):
    print(s1.loc[i*2])

# It gives the value of an index M1

12
45
45

In [34]:
# M2

student.loc[:2]

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32

In [30]:
student.iloc[4]

student     peter
language       30
science        56
maths          45
history        65
Name: 4, dtype: object

In [36]:
student.iloc[:2]

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67

student[student.